Repository: michael-andreev/get-pdf-online
Catalog: src/PrecizeSoft.GetPdfOnline.Web.SpaApp/ClientApp/locale/messages.*.xlf
Languages: ru

source: Convert to PDF
ru: Конвертировать в PDF

source: Download
ru: Загрузка

source: Statistics
ru: Статистика

source: Developers
ru: Разработчикам

source: About
ru: Информация

source: Michael Andreyev
ru: Михаил Андреев

source: Convert your files to PDF online and free! Just drop files here or click the button
ru: Конвертируйте файлы в PDF онлайн и бесплатно! Просто перетащите их сюда или нажмите на кнопку

source: Select files
ru: Выбрать файлы

source: Please wait...
ru: Пожалуйста, подождите...

source: Error!
ru: Ошибка!

source: Download all
ru: Загрузить все

source: Delete all
ru: Удалить все

source: Converted files
ru: Файлы

source: Kb
ru: Кб

source: Error:
ru: Ошибка:

source: Excellent tool
ru: Превосходный<br/>инструмент

source: We can convert to PDF more than
ru: Мы можем сконвертировать в PDF более

source: 250 different file types
ru: 250 различных видов файлов

source: , support all platforms and mobile devices. We do it for free, because we don't use any 3rd party commercial software. Your privacy is very important to us. We are using https for encrypting and delete all your files from our servers forever after one hour.
ru: , поддерживаем любые платформы и мобильные устройства. Мы делаем это бесплатно, потому что не используем никакого стороннего платного ПО. Мы заботимся о вашей безопасности: используем https для шифрования и удаляем ваши файлы с наших серверов навсегда через один час.

source: Read more »
ru: Подробнее »

source: Offline App
ru: Оффлайн-<br/>приложение

source: You can download our offline application and convert files on your PC without need to send files via the Internet. It works under Windows operating system (7 and above), installs in one click and doesn't require any 3rd-party software. It also can works via local area network in a browser.
ru: Вы можете загрузить наше оффлайн-приложение и конвертировать файлы на своём компьютере без передачи их через Интернет. Приложение работает под операционной системой Windows (версии 7 или выше), устанавливается за один клик и не требует какого-либо стороннего ПО. Оно также может работать по локальной сети через интернет-браузер.

source: Go to Download Page »
ru: Страница загрузки »

source: Easy integration
ru: Легкая<br/>интеграция

source: If you are developer and looking for a free solution to convert files to PDF, you can easily integrate with our REST or SOAP API from any platform in just few minutes. If you need to work offline, you can install our free Offline Application, which contains the same API services, and use it locally.
ru: Если вы разработчик, ищущий бесплатное решение для конвертации файлов в PDF, вы можете интегрироваться с нашим REST или SOAP API на любой платформе за считанные минуты. Если вам требуется оффлайн-решение, просто установите наше приложение, которое содержит идентичные API-сервисы, и используйте их локально.

source: That's what I need! »
ru: Это то, что мне нужно! »

source: Really excellent?
ru: Действительно<br/>превосходно?

source: Your opinion is very important for us. Criticism and suggestions will be welcomed. We also collect data about files quality, their size and the time spent for converting to analyze it and make our service more better. You can evaluate work of our service at any time by viewing statistics of its work.
ru: Для нас очень важно ваше мнение. Мы будем рады критике и готовы выслушать ваши пожелания. Мы также собираем статистику по качеству файлов, времени их обработки и размеру для последующего анализа, чтобы сделать сервис ещё лучше. Вы можете оценить качество работы сервиса в любой момент, просмотрев статистику его работы.

source: View statistics »
ru: Просмотреть статистику »

source: List of supported file formats:
ru: Список поддерживаемых форматов файлов:

source: Close
ru: Закрыть

source: GetPDF.online Converter
ru: Конвертер GetPDF.online

source: Offline application for converting files to PDF that replies all functionality of the online tool. It's a web application runs as Windows Service that can works on the local PC or via Local Area Network.
ru: Оффлайн-приложение для конвертации файлов в PDF, которое полностью повторяет функционал онлайн-инструмента. Представляет собой веб-приложение, работающее в виде службы Windows, которое может работать как на локальном компьютере, так и по локальной сети.

source: Version:
ru: Версия:

source: Date published:
ru: Дата публикации:

source: Supported Operating System:
ru: Поддерживаемые операционные системы:

source: Prerequisites:
ru: Предустановки:

source: Minimum Hardware Requirements:
ru: Минимальные требования к оборудованию:

source: 1 GHz or faster processor, 1 GB of RAM, 700 MB of available hard disk space
ru: Процессор с тактовой частотой 1 ГГц или выше, ОЗУ объёмом 1 ГБ, 700 МБ доступного пространства на жёстком диске

source: File Name:
ru: Имя файла:

source: File Size:
ru: Размер файла:

source: 150 Mb
ru: 150 МБ

source: {START_LINK}Download{CLOSE_LINK}
ru: {START_LINK}Загрузить{CLOSE_LINK}

source: Summary
ru: Сводка

source: Total queries count:
ru: Общее число запросов:

source: Good
ru: хороших

source: Bad
ru: плохих

source: First request:
ru: Первый запрос:

source: Last request:
ru: Последний запрос:

source: Average query duration (sec):
ru: Средняя продолжительность запроса (сек):

source: Min
ru: мин

source: Max
ru: макс

source: Average input file size (Kb):
ru: Средний размер входящего файла (Кб):

source: Average output file size (Kb):
ru: Средний размер исходящего файла (Кб):

source: Total traffic (Kb):
ru: Суммарный траффик (Кб):

source: Input
ru: входящий

source: Output
ru: исходящий

source: File types
ru: Типы файлов

source: Daily stat
ru: Статистика за день

source: Overview
ru: Обзор

source: You can easily integrate with one of two our APIs from any platform:
ru: Вы можете легко интегрироваться с одним из двух наших API на любой платформе:

source: uses JSON message format and provides truly simple method of integration.
ru: использует JSON-формат сообщений и предоставляет поистине легкий метод интеграции.

source: uses XML message format and contains a standards-based Web services that mostly used in enterpise systems.
ru: использует XML-формат сообщений и содержит набор веб-сервисов, основанных на стандарте SOAP, широко применяемом в промышленных системах.

source: Both API can work under HTTP or HTTPS protocol. You can use our API online or you can install our free Offline Application, which contains the same API services, and use it locally.
ru: Оба вида API могут работать как по протоколу HTTP, так и по HTTPS. Вы можете использовать наши API онлайн, либо установить наше бесплатное оффлайн-приложение, которое содержит идентичные API-сервисы, и использовать их локально.

source: Your first integration
ru: Ваша первая интеграция

source: Create a file "convert.html" on your PC with the content listed below, open it and convert anything to PDF. Congratulations! You've just successfully integrated with our
ru: Создайте файл "convert.html" на своем компьютере с содержимым, приведенным ниже, откройте его и сконвертируйте что-либо в PDF. Поздравляем! Вы только что успешно интегрировались с нашим

source: Swagger definition:
ru: Swagger-спецификация:

source: Available services:
ru: Доступные сервисы:

source: Converter V1 Service
ru: Сервис конвертации V1

source: Statistics V1 Service
ru: Сервис статистики V1

source: Home
ru: О проекте

source: Contact us
ru: Обратная связь

source: Technologies
ru: Технологии

source: Our goal is to create easy to use free tool for converting files to PDF with maximum possible quality.
ru: Наша цель - создание максимально простого и качественного бесплатного инструмента для экспорта в PDF.

source: Our users can convert files to PDF with a minimum of effort and without need to pay or see ad. They also can do it offline.
ru: Наши пользователи могут получить PDF с минимальными усилиями без единого намека на рекламу или оплату, а также могут сделать это оффлайн.

source: Our tool is oriented, first of all, to developers who need to implement export to PDF in their own pojects, which mostly causes serious problems.
ru: Наш инструмент ориентирован, в первую очередь, на разработчиков, которым требуется реализовать экспорт в PDF в своих системах, что зачастую вызывает серьезные сложности.

source: The fact is that qualitative commersial offline tools are very expensive (the price can be of many tens of thousand dollars), online tools can't be applied in many situations by security directives, while free products can't provide a good quality or require a lot of efforts for implementation. That's why decided to solve this problems in our tool.
ru: Дело в том, что качественные платные оффлайн-решения стоят очень дорого (сумма может доходить до нескольких десятков тысяч долларов), онлайн-инструменты во многих случаях просто не подходят по вопросам безопасности, а бесплатные могут не обеспечивать нужного качества или требовать серьезных усилий на реализацию. Поэтому мы попытались решить эти проблемы в своем инструменте.

source: At this moment our offline tool can be installed only on Windows machines, because it have some dependencies on Windows libraries, but in the future we plan to solve this questions and release versions for Linux and MacOS. Our tool is absolutely free to use, but it's not open source.
ru: На текущий момент наше оффлайн-приложение может быть установлено только на ОС Windows, т.к. имеются зависимости от некоторых Windows-библиотек, но в дальнейшем мы планируем разрешить эти вопросы и выпустить версии под Linux и MacOS. Использование нашего инструмента полностью бесплатно, но исходный код является закрытым.

source: At definite stage we plan to make our project open source, allowing everyone to contribute to it.
ru: На определенном этапе мы планируем открыть исходные коды, благодаря чему любой желающий сможет внести свой вклад в развитие проекта.

source: If you have any questions, please,
ru: Если у вас возникли вопросы, пожалуйста,

source: contact us
ru: свяжитесь с нами

source: , we'd be glad to answer you.
ru: , мы с удовольствием на них ответим.

source: You also can learn more about technologies that we are used on the
ru: Вы также можете более подробно узнать о технологиях, применяемых в данном инструменте, на странице

source: Hello! My name is Michael Andreyev. I'm a founder of this project and a single developer at this moment. I'm glad to answer your questions, read comments or get criticism or suggestions. Please contact with me via
ru: Здравствуйте! Меня зовут Михаил Андреев. Я являюсь основателем и, на текущий момент, единственным разработчиком данного проекта. Я с удовольствием отвечу на ваши вопросы, прочитаю комментарии и приму к сведению замечания и предложения. Свяжитесь, пожалуйста, со мной по

source: e-mail
ru: электронной почте

source: . You also can get more information about me on my
ru: . Вы также можете больше узнать обо мне на моем

source: web-site
ru: веб-сайте

source: Here is the main technologies that we are using in our tool:
ru: Ниже приведён список основных технологий, которые мы используем в нашем инструменте:

source: - a blazing fast, lightweight and modular platform for creating web applications and services that run on Windows, Linux and Mac. It's fully open source.
ru: - потрясающе быстрая, легковесная и модульная платформа с открытым исходным кодом для создания веб-приложений и сервисов, работающих под Windows, Linux и Mac.

source: - an open source platform for building mobile and desktop web applications led by the Angular Team at Google and by a community of individuals and corporations.
ru: - платформа с открытым исходным кодом для построения мобильных и десктопных веб-приложений, развиваемая командой Angular в Google, а также сообществом, включающим корпорации и отдельных разработчиков.

source: - a JavaScript runtime built on Google's Chrome V8 high-performance, open source JavaScript engine.
ru: - среда исполнения JavaScript, построенная на высокопроизводительном движке с открытым исходным кодом Google Chrome V8.

source: - the most powerful Free and Open Source office suite on the market.
ru: - наиболее мощный бесплатный офисный пакет с открытым исходным кодом на рынке.

source: - a self-contained, high-reliability, embedded, full-featured, public-domain, SQL database engine. SQLite is the most used database engine in the world.
ru: - автономная, высоконадежная, встраиваемая, полнофункциональная, свободно используемая СУБД. SQLite является наиболее используемой СУБД в мире.

source: - a collection of rich UI components for Angular. PrimeNG is a sibling of the popular JavaServer Faces Component Suite, PrimeFaces. All widgets are open source and free to use under MIT License.
ru: - набор богатых компонентов пользовательского интерфейса для Angular. PrimeNG является потомком популярного пакета компонентов JavaServer Faces разработки PrimeFaces. Все компоненты имеют открытый исходный код и бесплатны для использования под лицензией MIT.

source: - the most popular HTML, CSS, and JS framework for developing responsive, mobile first projects on the web.
ru: - наиболее популярный HTML, CSS, JS фреймворк для разработки отзывчивых, mobile-first веб-проектов.

source: - the world’s largest framework of API developer tools for the OpenAPI Specification(OAS), enabling development across the entire API lifecycle, from design and documentation, to test and deployment.
ru: - самый большой в мире фреймворк инструментов разработки API для OpenAPI Specification (OAS), позволяющий вести разработку сквозь весь жизненный цикл API, начиная с дизайна и документирования, и заканчивая тестированием и развёртыванием.

source: - Microsoft’s unified programming model for building service-oriented applications. It enables developers to build secure, reliable, transacted solutions that integrate across platforms, and interoperate with existing investments.
ru: - единая модель программирования Майкрософт для построения ориентированных на службы приложений. Она позволяет разработчикам построить безопасные надежные решения с поддержкой транзакций и возможностью кроссплатформенной интеграции и взаимодействия с существующими инвестициями.

source: - a powerful image manipulation library that supports over 100 major file formats (not including sub-formats).
ru: - мощная библиотека обработки изображений, которая поддерживает более 100 основных форматов файлов (не включая подформаты).

source: - the most powerful set of tools available to create Windows installation packages.
ru: - наиболее мощный набор инструментов, доступный для создания пакетов установки Windows.
