Repository: michael-andreev/get-pdf-online
Catalog: src/PrecizeSoft.GetPdfOnline.Web.MvcCoreApp/Resources/Views/Home/Index.*.resx
Languages: ru

source: &amp;nbsp;to PDF, support all platforms and mobile devices.
ru: , поддерживаем любые платформы и мобильные устройства.

source: and all your files will be deleted from our servers forever in an hour after the conversion.
ru: а ваши файлы удаляются с наших серверов навсегда через час после конвертации.

source: Close
ru: Закрыть

source: Convert to PDF
ru: Конвертировать в PDF

source: Convert your files to PDF online and free!
ru: Конвертируйте ваши файлы в PDF онлайн и бесплатно!

source: Converted files
ru: Конвертированные файлы

source: different file types
ru: различных вида файлов

source: Excellent tool
ru: Превосходный инструмент

source: Select file
ru: Выбрать файл

source: Go to Download Page
ru: Страница загрузки

source: It also can works via local area network in a browser if you will install required components.
ru: Оно также может работать по локальной сети через интернет-браузер, если вы установите необходимые компоненты.

source: It works under Windows operating system (7 and above) and installs in one click.
ru: Приложение работает под операционной системой Windows (версии 7 или выше) и устанавливается за один клик.

source: List of supported file formats:
ru: Список поддерживаемых форматов файлов:

source: Offline App
ru: Оффлайн-приложение

source: Read more
ru: Подробнее

source: We can convert
ru: Мы можем сконвертировать в PDF<br/>

source: We do it for free, because we don't use any 3rd party commercial software.
ru: Мы делаем это бесплатно, потому что не используем никакого стороннего платного программного обеспечения.

source: You can download our offline application and convert files on your PC without need to send files via the Internet.
ru: Вы можете загрузить наше оффлайн-приложение и конвертировать файлы на своём компьютере без необходимости передачи их через Интернет.

source: Your PDF files will appear here,&lt;br/&gt;once you convert them.
ru: Ваши PDF-файлы появятся здесь<br/>(сразу после конвертации).

source: Your privacy is very important to us. We are using https protocol for encrypting all communications,
ru: Безопасность ваших данных чрезвычайно важна для нас: мы используем https-протокол для шифрования всех запросов,

source: Easy integration
ru: Легкая интеграция

source: If you are .NET developer, just download our libraries from Nuget.
ru: Если вы .NET-разработчик, у вас есть возможность скачать наши библиотеки из Nuget и подключить их к своему проекту напрямую.

source: If you are developer and looking for a free solution to convert files to PDF,
ru: Если вы разработчик, ищущий бесплатное решение для конвертации файлов в PDF,

source: If you need to work offline, you can install our free Offline Application, which contains the same API services, and use it locally.
ru: Если вам требуется оффлайн-решение, просто установите наше приложение, которое содержит идентичные API-сервисы, и используйте их локально.

source: Really excellent?
ru: Действительно превосходно?

source: That's what I need!
ru: Это то, что мне нужно!

source: View statistics
ru: Просмотреть статистику

source: We collect data about files quality, their size and the time spent for converting to analyze it and make our service more better.
ru: Мы собираем статистику по качеству файлов, времени их обработки и размеру для последующего анализа, чтобы сделать сервис ещё лучше.

source: you can easily integrate with our REST or SOAP API from any platform in just few minutes.
ru: вы можете интегрироваться с нашим REST или SOAP API на любой платформе за считанные минуты.

source: You can evaluate work of our service at any time by viewing statistics of its work.
ru: Вы можете оценить качество работы сервиса в любой момент, просмотрев статистику его работы.

source: Your opinion is very important for us. Please rate the quality of generated PDF files after you convert them.
ru: Для нас очень важно ваше мнение. Пожалуйста, оцените качество сформированных PDF-файлов сразу после конвертации.

source: Just drop file here or click the button
ru: Просто перетащите файл сюда или нажмите на кнопку

source: Kb
ru: Кб
